Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: На панели расположены кнопки, по нажатию на которые в область кода выражения вставляется заготовка либо шаблон.
en: The toolbar includes the buttons that enable to insert a template or preset layout into the expression code area upon their pressing.

source: На панели расположены кнопки, по нажатию на которые в область кода выражения вставляется заготовка либо шаблоны.
en: The toolbar includes the buttons that enable to insert templates or preset layout into the expression code area upon their pressing.

source: На первом этапе настройки указываются следующие параметры:
en: The following parameters are specified at the first configuration stage:

source: На первом этапе необходимо задать назначение полей входного набора данных.
en: It is required to set the usage type of the input data set fields at the first stage.

source: На первом этапе необходимо задать назначение столбцов входного набора данных.
en: It is required to set the usage type of the input data set columns at the first stage.

source: На первом этапе проектирования описывают решение поставленной задачи, выделяя независимые подзадачи.
en: Solution of the set task is described at the first design step specifying independent subtasks.

source: На пересечении, в ячейках таблицы, расположены значения статистических показателей соответствующих полей (см.
en: The values of statistical indicators of corresponding fields are located in the table cells at the intersection (refer to

source: На практике часто встречаются ситуации, когда пользователю требуется получить отчет по некоторому подмножеству всех доступных данных, например, только по одному поставщику или клиенту, по нескольким группам товаров или регионам.
en: Practically it often happens that the user needs to receive the report on some subset of all available data, for example, data on one supplier or client, several groups of goods or regions.

source: На практике чаще всего выбирается $$k=10$$ (10 — проходная перекрестная проверка), когда модель обучается на 9/10 данных и тестируется на 1/10.
en: Practically $$k=10$$ is more frequently selected (10 — 10-fold cross validation) when the model is trained using 9/10 of data and it is tested using 1/10.

source: На предмет соответствия этому условию анализируется значение выходной переменной узла, заключенного в цикл.
en: The value of the looped output node variable is analysed to ensure its compliance with this condition.

source: На пропущенное
en: With Empty

source: На пропущенное;
en: With empty.

source: На регулярное выражение
en: With Regular Expression

source: На регулярное выражение.
en: With regular expression.

source: На рисунке «Пример сценария» узел «ABC-анализ» является производным компонентом — подмоделью.
en: The "Workflow Example" figure shows the "ABC analysis" node that is a derived component - supernode.

source: На рисунке представлен фрагмент сценария с открытым окном Инспектора свойств для узла Калькулятор:
en: The workflow fragment with the opened Property inspector window is shown on figure below for the Calculator node:

source: На рисунке цветом выделены отдельные кластеры и объекты, им принадлежащие.
en: Separate clusters and objects that relate to them are highlighted by color.

source: На сервере Loginom
en: on the Loginom server

source: На сервере Loginom, если проект не сохранен, то текущий каталог совпадает с каталогом пользователя.
en: As far as the Loginom server is concerned, if the project is not saved, the current directory matches the user directory.

source: На следующем аналогично описывают подзадачи, формулируя при этом элементы следующего уровня.
en: Subtasks are similarly described at the next step with specification of the next level items.

source: На созданных таким образом узлах отображается кнопка "Показать базовый узел", которая позволяет найти базовый узел (в случае, если он расположен в пределах текущей области построения Сценария).
en: "Show base node" button is displayed on the nodes created in such a way. It enables to find the base node (if it is located in the current Workflow construction area).

source: На стартовой странице Loginom ввести имя пользователя и пароль учетной записи, которая имеется на LDAP сервере и если авторизация прошла успешно, то подключение из Loginom к LDAP серверу настроено правильно.
en: It is required to enter the username and password of the account available on the LDAP server on the Loginom home page. If the authorization is successful, connection to the LDAP server from Loginom has been correctly set.

source: На странице Настройка выходных столбцов мастера настройки задаются состав и параметры полей выходного набора.
en: Composition and features of the output data set fields are set on the following wizard page: Configure Output Columns.

source: На таблице ниже представлено какой вид данных можно использовать при каждом типе данных.
en: The table below shows the data kind that can be used for each data type.

source: На физическом уровне Deductor Warehouse представляет собой реляционную базу данных на платформе Firebird, MS SQL или Oracle, поэтому работа с хранилищем на этом уровне ничем не отличается от обслуживания любой СУБД.
en: At the physical level Deductor Warehouse is a relational database based on the Firebird, MS SQL or Oracle platform. That is why the data warehouse operation does not differ from any DBMS service at this level.

source: На этапе настройки указываются следующие параметры:
en: It is required to specify the following parameters at the configuration stage:

source: На этапе настройки указываются:
en: The following parameters are specified at the configuration stage:

source: На этом этапе входные данные можно разделить на тестовое, обучающее и валидационное множества (выборки).
en: At this stage, the input data can be divided into the test, training and validation sets (samples).

source: На этом этапе входные данные приводятся к нормальному виду - преобразуются из натуральных значений в безразмерные для того, чтобы данные, имеющие большой разброс значений, не превалировали над данными с меньшим разбросом значений.
en: At this stage, the input data is set to the normal kind. It is transformed from the natural values to the non-dimensional ones to ensure that the data with wide scatter of values does not prevail over the data with less significant scatter of values.

source: На этом этапе настраивается передача значений выходных переменных соответствующим входным переменным на следующей итерации цикла.
en: During this stage, it is required to configure transfer of values of the output variables to the corresponding input variables at the next loop iteration.

source: Набор A:
en: Set A:

source: Набор B:
en: Set B:

source: Набор C:
en: Set C:

source: Набор компонентов для первоначальной подготовки и простой обработки исходных наборов данных.
en: A set of components for the initial preparation and ordinary processing of the source data sets.

source: Набор параметров для настройки линейной регрессии можно сгруппировать в следующие блоки:
en: A set of parameters to configure the linear regression can be grouped in the following packs:

source: Набор параметров для настройки логистической регрессии можно сгруппировать в следующие блоки:
en: A set of parameters to configure the logistic regression can be grouped in the following packs:

source: Наборы элементов, наиболее часто встречающиеся в транзакциях (частые наборы).
en: The itemsets most frequently occurring in transactions (frequent itemsets).

source: Навигация
en: Navigation

source: Навигация по подключениям осуществляется с помощью инструментов:
en: The following tools are used for navigation through the connections:

source: Навигация по таблице осуществляется при помощи мышки и панели навигации в нижней части визуализатора:
en: Mouse and navigation panel in the lower part of the visualizer are used for navigation through the table:

source: Над непрерывными значениями можно проводить арифметические операции, и они имеют смысл.
en: Continuous values are appropriate in arithmetic operations and they have meaning.

source: Над ними располагается строка состояния входа.
en: Login status row is located below them.

source: Над полями расположены три кнопки:
en: Three buttons are located over the fields:

source: Над списком доступных полей расположено поле Фильтрация, оно позволяет найти поле по имени или его части.
en: The Filter field is located over the list of the available fields. It enables to find the field by name or its part.

source: Нажав %kbd Alt S %.
en: Pressing %kbd Alt S %.

source: Нажав кнопку Добавить.
en: by pressing Add button.

source: Нажав на данную кнопку, открывается панель со следующими командами:
en: This button enables to use the panel with the following commands:

source: Нажав на кнопку уточнить откроется окно Список значений (см.
en: By pressing to be defined button, the List of values window will be opened (refer to the information

source: Нажатие на удаляет ранее выбранное поле.
en: It is possible to delete the field that has been earlier selected by pressing .

source: Нажатие на данную кнопку открывает панель со следующими командами:
en: Press this button to open the panel with the following commands:

source: Нажатие на кнопку скрывает панель со списком входных столбцов, повторное нажатие возвращает панель.
en: Pressing the button enables to hide the bar with the list of input columns, whereas the repeated pressing returns the bar.

source: Нажать "Применить".
en: press "Apply".

source: Нажать на кнопку нужного поля в столбце ;
en: to press required field in column button;

source: Нажать на кнопку Удалить Удалить.
en: Press Delete Delete button.

source: Название
en: Name

source: Название таблицы — уникальное в пределах БД имя таблицы.
en: Table name is a unique table name in DB.

source: Название товара
en: Name of goods

source: Название — название серии, как правило, соответствует названию поля, из которого берутся значения для построения диаграммы.
en: Name: generally, the series name matches the name of the field from which the values for chart construction are taken.

source: Назначать случайно — типы границ интервалов будут определены случайно; возможно включение одинаковых значений в тот или иной интервал случайным образом.
en: Assign randomly: types of bin bounds will be randomly assigned. It is possible to include the same values into this or that bin in a random manner.

source: Назначение входных столбцов
en: Usage Type of Input Columns

source: Назначение поля
en: Field usage type

source: Назначение столбца
en: Column usage type

source: Назначение.
en: Designation

source: Наиболее близкие узлы соответствуют похожим объектам, а удаленные друг от друга — непохожим.
en: The closest nodes map the similar objects, and the objects that are remote from each other map the dissimilar ones.

source: Наиболее близкое к исходному
en: The closest to source

source: Наиболее часто используемый вид диаграмм — двумерный график.
en: Two-dimensional chart is the most widely used type of charts.

source: Наибольшее допустимое количество классов, создаваемое обработчиком для столбца.
en: The highest allowable count of classes generated by the handler for a column.

source: Наименование, входные аргументы и описание доступных для использования функций.
en: Name, input argument and description of the functions available for use

source: Наименования встроенных функций Калькулятора и JavaScript не пересекаются.
en: Names of the built-in functions of Calculator and JavaScript do not intersect each other.

source: Наличие скидки
en: Discount availability

source: Написание команд
en: Writing Commands

source: Например, 10 наименее популярных товаров.
en: For example, 10 least popular goods.

source: Например, Find("A", "A000A00A", 2) вернет позицию второго слева вхождения подстроки "А" в строку "A000A00A", т.е. 5; Find("A", "A000A00A", -1) вернет позицию первого справа вхождения подстроки "А" в строку "A000A00A", т.е. 8.
en: For example, Find("A", "A000A00A", 2) will return position of the second left occurrence of substring "A" to string "A000A00A", namely, 5; Find("A", "A000A00A", -1) will return position of the first right occurrence of substring "A" to string "A000A00A", namely, 8.

source: Например, Replace("A000а00A", "А", "B", True, True) вернет строку "B000B00B" , т.е. заменит все вхождения строки "А" на строку "В" игнорируя регистр символов; Replace("A000а00A", "А", "B", True, False) вернет строку "B000а00B".
en: For example, Replace("A000а00A", "А", "B", True, True) will return string "B000B00B", namely, it will replace all occurrences of string "А" with string "В" ignoring the character case; Replace("A000а00A", "А", "B", True, False) will return string "B000а00B".

source: Например, авторизация через социальные сети.
en: For example, authorization via social networks.

source: Например, в "Отбор со смещением" нужны данные из входного набора.
en: For example, the data from the input data set is required in "Biased sampling".

source: Например, вещественную переменную можно заменить целочисленной или строковой.
en: For example, it is possible to replace the real variable with the integer or string one.

source: Например, временной или иной ряд, значения которого упорядочены по возрастанию или убыванию (например, по дате или времени).
en: For example, time or other series the values of which are ordered in ascending or descending order (for example, by date or time).

source: Например, группа «Аналитические отчеты» может содержать различные кубы данных, группа «Прогнозы» может содержать диаграммы прогнозов каких-либо величин.
en: For example, the "Analytical reports" group can contain different data cubes, whereas the "Forecast" group can contain the forecast charts of some values.

source: Например, для измерения Товар атрибутами могут выступать Цвет, Вес, Габариты.
en: For example, to provide a dimension for Goods, Color, Weight, Sizes can be attributes.

source: Например, для пользователей Windows одним из источников этих настроек для сервера Loginom являются настройки "Язык и региональные стандарты".
en: For example, one of the sources of these settings for Windows users for the Loginom server are "Language and regional standards" settings.

source: Например, если имеются данные о суммах совершенных продаж конкретных товаров, эти данные можно использовать для разгруппировки по товарам таблицы прогноза, сделанного только для товарных групп.
en: For example, if there is data on the effected sales amount for particular goods, this data can be used for ungrouping by the goods listed in the table with the forecast made only for groups of goods.

source: Например, если на каждой итерации происходит обращение к источнику данных, не допускающему параллельные запросы.
en: For example, if access to the data source that does not support parallel requests is required for each iteration.

source: Например, если необходимо выгрузить данные во внешний источник и следующим действием загрузить уже модифицированные данные из внешнего источника.
en: For example, if it is required to download data to the external source and then download already modified data from the external source.

source: Например, если транзакцией является чек, а элементами — товары, то в качестве вспомогательных данных могут быть использованы: пол покупателя, возраст, регион, сезон и т.д.
en: For example, if the check is a transaction, and items are goods, the following data can be used as the supplementary one: sex of consumer, age, region, season, etc.

source: Например, если этому параметру задано значение 50, то поля, содержащие более 50% пропусков, заполняться не будут.
en: For example, if 50 value is set for this parameter, the fileds that contain more than 50% of null data will not be filled in.

source: Например, очевидно, что показатель Максимальная длина строки не будет доступен для поля числового или логического типов.
en: For example, it is obvious that Maximum string length indicator will not be available for the field related to the numeric or logical types.

source: Например, первое поле - код покупателя, второе - список его покупок.
en: For example, the first field is the buyer's code, the second one - a list of his purchases.

source: Например, следующие цепочки узлов будут выполнены параллельно (см.
en: For example, the following chains of nodes will be executed in parallel (refer to

source: Например, сложное условие вида: "A ИЛИ B И C ИЛИ D И E И F" удет выполняться следующим образом: "A ИЛИ (B И C) ИЛИ (D И E И F)"
en: For example, the following complex criterion: "A OR B AND C OR D AND E AND F" will be executed as follows: "A OR (B AND C) OR (D AND E AND F)".

source: Например, составная метка "ROOT|PERSON|ACCES-LEVEL" будет сформирована для поля извлеченной таблицы, содержащего данные атрибута "ACCESS-LEVEL" элемента "PERSON" из корневого элемента "ROOT" документа.
en: For example, complex "ROOT|PERSON|ACCES-LEVEL" caption will be generated for the extracted table field that contains the data of "ACCESS-LEVEL" attribute of "PERSON" element from the root element of "ROOT" document.

source: Например, составная метка ROOT|PERSON|ACCES-LEVEL будет сформирована для поля импортированной таблицы, содержащего данные атрибута ACCESS-LEVEL элемента PERSON из корневого элемента ROOT файла.
en: For example, complex ROOT|PERSON|ACCES-LEVEL caption will be generated for the imported table field that contains the data of ACCESS-LEVEL attribute of PERSON element from the root element of ROOT file.

source: Например, старый файл app.log при превышении указанного размера сохранится как app.log.1, а взамен ему будет создан новый app.log, где и продолжится ведение журнала.| |Количество резервных файлов|10|Количество резервных копий создаваемых при превышении максимального размера лог-файла.
en: For example, the old app.log file is saved as app.log.1 when this size is exceeded, and the new app.log file will be created instead of it where the log is maintained further.| |Number of backup files|10|Number of backup copies created when the maximum size of the log file is exceeded.

source: Например, фильтр для Active Directory может быть (&(objectClass=user)(memberOf:1.2.840.113556.1.4.1941:=cn=test,ou=groups,dc=domain,dc=com)), для OpenLDAP (objectClass=posixAccount), где использование расширения :1.2.840.113556.1.4.1941: для Active Directory дает возможность использовать сопоставление и по вложенным группам (можно использовать только для Active Directory).
en: For example, filter for Active Directory can be (&(objectClass=user)(memberOf:1.2.840.113556.1.4.1941:=cn=test,ou=groups,dc=domain,dc=com)), for OpenLDAP (objectClass=posixAccount) where use of extension :1.2.840.113556.1.4.1941: for Active Directory enables to use mapping also by nested groups (it can be used only for Active Directory).

source: Например, флаг активен: 10 <...≤ 20 и флаг неактивен: 10 ≤...< 20.
en: For example, the checkbox is active: 10 <...≤ 20, the checkbox is inactive: 10 ≤...< 20.

source: Например, это могут быть названия фирм-поставщиков, идентификационный номер товаров, ФИО людей и т.д.
en: For example, it could be names of vendor companies, product identification number, full names of people, etc.

source: Например:
en: For example:

source: Например: для узла Цикл подчиненной считается Подмодель, в которой выполняются действия итерации.
en: For example, the Supernode in which the iteration actions are performed is considered to be subordinate for the Loop node.

source: Например: после операции вида 02.01.2020 12:00 - 01.01.2020 00:00 результат будет равен 1.5 - один целый день (24 часа) и еще половина дня (12 часов).
en: For example: after such operation as 02.01.2020 12:00 - 01.01.2020 00:00 the result will be equal to 1.5 - one full day (24 hours) and half a day (12 hours).

source: Наряду с анализом основных данных транзакций возможно учитывать и вспомогательные.
en: Alongside with analysis of the main transaction data, it is possible to take into account the supplementary one.

source: Наряду с критерием Акаике и критерием Байеса, выдается в результатах оценки моделей с дискретными и ограниченными зависимыми переменными
en: Alongside with the Akaike and Bayesian criteria, it is specified in the results of assessment of the models with discrete and limited dependent variables

source: Наряду с наборами данных, представляющих из себя таблицу данных, в Studio объектом, используемым в вычислениях, может быть переменная.
en: Alongside with the data sets constituting data table, the object used in calculations can be a variable in Studio.

source: Наряду со стандартными правилами сравнения символов (collation) BINARY, RTRIM и NOCASE возможно использование нижеследующих, не регламентированных стандартом SQLite.
en: Alongside with the standard character collation rules, namely, BINARY, RTRIM and NOCASE, it is possible to use the following ones that are not subject to the SQLite standard.

source: Население (тыс.
en: Population (thous.

source: Наследование осуществляется механизмом обновления производных узлов при изменении базового.
en: The inheritance is performed using the mechanism of the derived nodes update when changing the base one.

source: Наследуемый узел
en: Inherited node

source: Настраиваемое значение "события" — требуется выбрать значение бинарной целевой переменной, которое является событием.
en: Custom "event" value: it is required to select the value of the binary target variable that is an event.

source: Настроить сортировку можно, щёлкая на заголовки столбцов непосредственно в самом визуализаторе.
en: It is possible to configure sorting by clicking on the columns headers in the visualizer as such.

source: Настройка
en: Wizard

source: Настройка нормализации;
en: Configuration of normalization;

source: Настройка автоматического подбора параметров Нейросети
en: Configure Auto Selection of Neural Network Parameters

source: Настройка вида цикла
en: Configuration of the Loop Type

source: Настройка включает несколько шагов.
en: Setup includes several steps.

source: Настройка внешней таблицы
en: Configuration of the External Table

source: Настройка внутренней таблицы
en: Configuration of the Internal Table

source: Настройка входного набора
en: Configuration of the Input Data Set

source: Настройка входных столбцов
en: Configure input columns

source: Настройка входных столбцов.
en: Configure input columns.

source: Настройка входных столбцов;
en: Configure input columns;

source: Настройка диаграммы
en: Chart Configuration

source: Настройка заполнения пропусков
en: Imputation Configuration

source: Настройка запроса
en: Configure Request

source: Настройка источников осуществляется в администраторе источников данных ODBC Windows.
en: The sources are configured in ODBC Windows data sources administrator.

source: Настройка компонента происходит в два этапа:
en: The component is configured in two steps:

source: Настройка линейной регрессии
en: Linear Regression Configuring

source: Настройка логистической регрессии
en: Logistic Regression Configuring

source: Настройка метода
en: Configure Method

source: Настройка метода агрегации для каждого показателя производится в отдельном окне.
en: The aggregation method is configured for each parameter in a separate window.

source: Настройка нормализации
en: Configuration of Normalization

source: Настройка нормализации доступна как отдельная страница в мастерах:
en: Normalization configuration is available as a separate page in the following wizards:

source: Настройка обрабатываемых исключений
en: Configure Exception Handled

source: Настройка ответа сервиса
en: Configure Service Response

source: Настройка отображения показателей гистограммы;
en: Configure display of the histogram indicators;
